import random as r
date=['红心A','红心2','红心3','红心4','红心5','红心6','红心7','红心8', '红心9','红心10','红心J','红心Q','红心K',
'黑桃A','黑桃2','黑桃3', '黑桃4','黑桃5','黑桃6','黑桃7','黑桃8', '黑桃9','黑桃10','黑桃J', '黑桃Q','黑桃K',
'方块A','方块2','方块3','方块4','方块5','方块6','方块7','方块8', '方块9','方块10','方块J','方块Q','方块K','梅花A',
'梅花2','梅花3','梅花4','梅花5','梅花6','梅花7','梅花8', '梅花9','梅花10','梅花J','梅花Q','梅花K','小王','大王']
def do(x,z):
    m=[]
    for i in range(x):
        an=r.randint(0,len(date)-1-i)
        m.append(date[an])
        del (date[an])
    print(z)
    print(m)
    print("\n")
do(20,"地主的牌为：")
do(17,"农民1的牌为：")
print("农民2的牌为：")
print(date)
'''
print("\t")
date1=['红心A','红心2','红心3','红心4','红心5','红心6','红心7','红心8', '红心9','红心10','红心J','红心Q','红心K',]
for i in range(13):
    an=r.choice(date1)
    print(an,end=",")
   。 date1.remove (an)
'''
